In [32]:
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [33]:
data = Series (['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [34]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [35]:
data.dropna()
#This will drop all the null values

0     one
1     two
3    four
dtype: object

In [36]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [37]:
clean_dframe = dframe.dropna()
# This will not only drop the null values with no additional arguments, if there are any nulls the whole row gets dropped

In [38]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [39]:
dframe.dropna(how='all')
# This is how you keep the rows, (only drop the row if all values are null)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [40]:
dframe.dropna(axis=1)
# If column has a null drop it

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [41]:
npn=np.nan

dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [42]:
dframe2.dropna(thresh=2)
# I only want rows with at least two data points drop the rest

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [43]:
dframe2.dropna(thresh=3)
# At least 3 data points

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [44]:
dframe.fillna(1)
#fill all null values with 1

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [45]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [46]:
# Different values for different columns # of column
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [47]:
dframe2.fillna(0,inplace=True)
# This is going to modify the dframe

In [48]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0